# Series

# importing numpy and pandas

In [1]:
import numpy as np
import pandas as pd
# every method in Pandas has inplace attribute to keep the data safe

In [2]:
# series can take array,list,dictionary as data or indcies
# series give indicies and their corrosponding data
labels=['a','b','c']
my_data = [10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
ser1=pd.Series([1,2,3,4],['eman','amira','esraa','alaa'])

In [7]:
ser1

eman     1
amira    2
esraa    3
alaa     4
dtype: int64

In [8]:
ser2=pd.Series([1,2,3,5],['eman','amira','esraa','rana'])

In [9]:
ser2

eman     1
amira    2
esraa    3
rana     5
dtype: int64

In [10]:
ser3=ser1+ser2

In [11]:
# data which is found in the 2 serieses will be added to each other
# data that found in one series only will found NaN infront of them 
ser3

alaa     NaN
amira    4.0
eman     2.0
esraa    6.0
rana     NaN
dtype: float64

In [12]:
ser3['amira']

4.0

# DataFrames:

In [13]:
from numpy.random import randn

In [14]:
# seed is used to get some specific random numbers
np.random.seed(101)

In [15]:
# dataframe takes (data,list of row indicies,list of column indicies)
#dataframes gives table like an excel sheet 
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
#to get the W column 
# a series of rows in this column will return to us
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
# another way to get the W column 
#this way is the worst because if there is a function in df with the same name of the column it will be confused 
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
# to get the element of some columns 
# we put the name of columns we want in a list
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [20]:
# to create new column first we should know if this column is already exists
# so we make this stage by 
#df['new']
#if we got an error(key error) this means that this column is not exist
#if there is no error this means that the column is already exists
df['new']=df['W']+df['Y']

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
# to drop a column (remove it) we make it with drop method
# if we give drop the name of the column only we will gwt an error(value error) 
# because the default axis in this method in =0 (rows) so we should make it =1 bec. we are talking about the columns
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
# we notice that the col. new is not removed permenantly and this because there is an attribute in drop method which is called (inplace)
# this attribute the default value of it is false and this mean that don't drop this col. permenantly and this exists in pandas so we don't lose our data easily
#so when we set it into true we remove this col. permenantly
df.drop('new',axis=1,inplace=True)

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
# to get the elements of rows
# we have 2 methods to do this with loc method or with iloc method
# loc method takes the name of the row in alist
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [27]:
# iloc takes the number of the row we want in a list
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [28]:
# if we want a specific value we determine it by the name of row and the name of the column 
df.loc['C','Z']

-0.5890005332865824

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
# if we want some values in specific rows and columns
# we put the names of rows in alist first then the names of the columns secondly
df.loc[['A','C'],['W','Y']]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813

# Part 2: Selection

In [31]:
# with this condition we can get a boolean dataframe which tells us the values in df satisify this condition or not

df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [32]:
booldf=df>0

In [33]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [34]:
# here we get the values which satisify this condition and which is not satisfying we get NaN instead
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# here we get all the df without C row that have the value which is below 0 in W col.
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
boolser = df['W'] > 0
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [37]:
# this command is the last line but gathering it in one line
# we choose the X,Y columns from the df that we get from the W > 0 condition 
# we make this gathering to save up our memory 
df[df['W'] > 0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

# Multiple Conditions

In [38]:
# if we want to get a df resulting from multiple conditions we arenot able to use the and or or operators that are normally used in python
# that is because the normal operators can make the logic operation with single instances not with serieses
# so instead of that we use (& and |) symbols here
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
# this function is to show us the real indicies of each row in our df 
# note that the indicies that i made(A,B,...) is put into a column called index
# if we want to reset the indicies permenantly we can make the attribue (inplace) of this function to become True
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [41]:
# this function is to change the  indicies of each row in our df 

# if we want to set the indicies permenantly we can make the attribue (inplace) of this function to become True
new_ind='CA NY WY OR CO'.split()
df['States']=new_ind
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [42]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

# Part 3 : Multi level indicies

In [43]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [44]:
# here we notice that we have multi level indexing 
df2 = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [45]:
df2

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [46]:
# if we want to return values we use loc() method from outside ynto inside like this
df2.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [47]:
df2.loc['G1'].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [48]:
# if we want to name our indicies 
df2.index.names

FrozenList([None, None])

In [49]:
df2.index.names=['Groups','Nums']

In [50]:
df2

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [51]:
# to return a specific value we go from outside to inside then choose our col.
df2.loc['G1'].loc[3]['B']

0.39052784273374097

In [52]:
# another way to select values is cross section method (xs) 
# if we want all df that with Nums=1 this method helps us with this problem
df2.xs(1,level='Nums')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [53]:
# in some data there  are some missing values 
# pandas treat these values with dropna(),fillna()
# pandas call these values NaN
d1={'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[5,6,7]}

In [54]:
df3 = pd.DataFrame(d1)

In [55]:
df3

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6
2  NaN  NaN  7

In [56]:
# dropna() will remove every row has a single nan value( missing value)
# default value for axis in dropna() =0 means row 
df3.dropna()

     A    B  C
0  1.0  4.0  5

In [57]:
# we changed the value of axis to 1 to make the function remove the columns with (missing values)

df3.dropna( axis = 1)

   C
0  5
1  6
2  7

In [58]:
# thresh attribute is used to make the function know when to make drop to this row or col.
# thresh value indicate the minimum number of non nan values that after this number the function drops the row or col.

df3.dropna(thresh=2)

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6

In [59]:
df3

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6
2  NaN  NaN  7

In [60]:
# this method is to fill the nan values with specific values
df3.fillna(value='Fill Value')

            A           B  C
0           1           4  5
1           2  Fill Value  6
2  Fill Value  Fill Value  7

In [61]:
# to fill the nan value of col A with the mean value of the column
df3['A'].fillna(value=df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [62]:
data2 = {'Company':['google','google','msft','msft','fb','fb'],
        'Person':['eman','amira','esraa','alaa','bosy','yara'],
        'Sales':[120,250,330,400,500,700]}

In [63]:
df4=pd.DataFrame(data2)

In [64]:
df4

  Company Person  Sales
0  google   eman    120
1  google  amira    250
2    msft  esraa    330
3    msft   alaa    400
4      fb   bosy    500
5      fb   yara    700

In [65]:
# it is used to know something about group of things that share with each other the same thing (we grouping by it)
byComp=df4.groupby('Company')

In [66]:
# to know mean value of the sales of each company
byComp.mean()

         Sales
Company
fb         600
google     185
msft       365

In [67]:
# to know sum value of the sales of each company

byComp.sum()

         Sales
Company
fb        1200
google     370
msft       730

In [68]:
# to know standard deviation value of the sales of each company

byComp.std()

              Sales
Company
fb       141.421356
google    91.923882
msft      49.497475

In [69]:
byComp.sum().loc['fb']

Sales    1200
Name: fb, dtype: int64

In [70]:
byComp.count()

         Person  Sales
Company
fb            2      2
google        2      2
msft          2      2

In [71]:
byComp.min()

        Person  Sales
Company
fb        bosy    500
google   amira    120
msft      alaa    330

In [72]:
byComp.max()

        Person  Sales
Company
fb        yara    700
google    eman    250
msft     esraa    400

In [73]:
# to know all the information of each company

byComp.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
fb        2.0  600.0  141.421356  500.0  550.0  600.0  650.0  700.0
google    2.0  185.0   91.923882  120.0  152.5  185.0  217.5  250.0
msft      2.0  365.0   49.497475  330.0  347.5  365.0  382.5  400.0

In [74]:
byComp.describe().transpose()

Company              fb      google        msft
Sales count    2.000000    2.000000    2.000000
      mean   600.000000  185.000000  365.000000
      std    141.421356   91.923882   49.497475
      min    500.000000  120.000000  330.000000
      25%    550.000000  152.500000  347.500000
      50%    600.000000  185.000000  365.000000
      75%    650.000000  217.500000  382.500000
      max    700.000000  250.000000  400.000000

In [75]:
byComp.describe().transpose()['fb']

Sales  count      2.000000
       mean     600.000000
       std      141.421356
       min      500.000000
       25%      550.000000
       50%      600.000000
       75%      650.000000
       max      700.000000
Name: fb, dtype: float64

In [76]:
# concat to make union between 2 or more df
pd.concat([df,df4])

          W         X         Y         Z States Company Person  Sales
A  2.706850  0.628133  0.907969  0.503826     CA     NaN    NaN    NaN
B  0.651118 -0.319318 -0.848077  0.605965     NY     NaN    NaN    NaN
C -2.018168  0.740122  0.528813 -0.589001     WY     NaN    NaN    NaN
D  0.188695 -0.758872 -0.933237  0.955057     OR     NaN    NaN    NaN
E  0.190794  1.978757  2.605967  0.683509     CO     NaN    NaN    NaN
0       NaN       NaN       NaN       NaN    NaN  google   eman  120.0
1       NaN       NaN       NaN       NaN    NaN  google  amira  250.0
2       NaN       NaN       NaN       NaN    NaN    msft  esraa  330.0
3       NaN       NaN       NaN       NaN    NaN    msft   alaa  400.0
4       NaN       NaN       NaN       NaN    NaN      fb   bosy  500.0
5       NaN       NaN       NaN       NaN    NaN      fb   yara  700.0

In [77]:
right=pd.DataFrame({'key':[1,2,3],'A':['A0','A1','A2'],'B':['B0','B1','B2']})

In [78]:
left=pd.DataFrame({'key':[1,2,3],'C':['C0','C1','C2'],'D':['D0','D1','D2']})

In [79]:
# merge to make union based on specific col. 
pd.merge(left , right , how='inner' , on='key')

   key   C   D   A   B
0    1  C0  D0  A0  B0
1    2  C1  D1  A1  B1
2    3  C2  D2  A2  B2

In [80]:
right1 =pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']},index=['K0','K1','K2'])

In [81]:
left1 =pd.DataFrame({'C':['C0','C1','C2'],'D':['D0','D1','D2']},index=['K0','K1','K3'])

In [82]:
# join to make union based on indicies
right1.join(left1)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2  NaN  NaN

# searching for unique values

In [83]:
df0 = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','klm']})
df0

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  klm

In [84]:
# we have a function called unique() that finds the unique values of specific col.

df0['col2'].unique()

array([444, 555, 666], dtype=int64)

In [85]:
# to know the length of (number of) unique numbers
len(df0['col2'].unique())

3

In [86]:
# another way to know the length of (number of) unique numbers

df0['col2'].nunique()

3

In [87]:
# to know the number of iletration of each elements
df0['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [88]:
# apply method : it is used to apply methods (built in or any method we make) to a dataframe

def times2(x):
    return x*2

In [89]:
df0['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [90]:
df0['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [91]:
# to drop one column 
df0.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  klm

In [92]:
# to sort the values of specific column
df0.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  klm
1     2   555  def
2     3   666  ghi

In [93]:
# to know if the values of any column is equal to null
df0.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [94]:
# type of making another shape of the table with another soecific distribution 
df4.pivot_table(values='Sales',index=['Person'],columns=['Company'])

Company     fb  google   msft
Person
alaa       NaN     NaN  400.0
amira      NaN   250.0    NaN
bosy     500.0     NaN    NaN
eman       NaN   120.0    NaN
esraa      NaN     NaN  330.0
yara     700.0     NaN    NaN

In [95]:
# to read from excel file 
# we can read from (excel , csv , sql , html) files
pd.read_excel('example.xlsx')

    0   1   2   3
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15